"""
============================
Author:柠檬班-木森
Time:2019/9/21
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
格式化输出：

format


传统方式：%


"""

# 第一种方式:格式化输出

# 张三  李四  王五  张飞  关羽
# print("今天收到张三，交来学费：500，特开此收据为凭证")
# print("今天收到李四，交来学费：500，特开此收据为凭证")
# print("今天收到王五，交来学费：500，特开此收据为凭证")
# print("今天收到张飞，交来学费：500，特开此收据为凭证")
# print("今天收到关羽，交来学费：500，特开此收据为凭证")

# str1 = "今天收到{}，交来学费：{}，特开此收据为凭证"
# print(str1.format('张三',500))
# print(str1.format('李四',500))
# print(str1.format('王五',500))

# 默认当时，占几个位置，传几个值
# res1 = "aaa:{},bbb:{},cc{}".format(11,22,33)
# print(res1)
# 按位置传值
# res1 = "aaa:{2},bbb:{0},cc:{1}".format(11,22,33)
# print(res1)

# res1 = "aaa:{0},bbb:{0},cc:{1}".format(11,22)
# print(res1)

# 格式化输出
# res1 = "aaa:{b},bbb:{a},cc:{c}".format(a='555',b=2.2,c=33)
# print(res1)

# format格式化小数位数

# number = 2.56789
# res2 = "今天的白菜价格为：{:.4f}".format(number)
# print(res2)

# 左对齐  右对齐
# res3 = "a:{:>6s} b:{:>9s}".format('abc','123')
# res4 = "a:{} b:{}".format('abc111','123999999')
#
# print(res3)
# print(res4)

# 传统的格式化输出方式
# res5  = "名字：%s,年龄：%d,成绩：%.2f"%('小明',18,98.5)
#
# res6  = "名字：%s,年龄：%d,成绩：%.2f"%(1.7,18,98.5)
#
# print(res6)





