"""
============================
Author:柠檬班-木森
Time:2019/9/19
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
1、代码缩进:缩进来区分代码块，缩进四个空格（Tab键）

2、输入：内置函数input()

3、多行语句（单行代码分多行显示）



"""
# name = input("请输入名字：")
#
#
# print('***********************')
# print('姓名:',name)
# print('年龄：18')
# print('性别：男')
# print('***********************')

# print("***********************年龄：\
# 18***********************年龄：\
# 18***********************年***********************年龄：18龄\
# ：18***********************年龄：18")